Создать список покупок

---Добавить продукт в спиок или показать спиок? (ADD / SHOW)
ADD
--- Напишите название продукта
Молоко
---Молоко в списке

---Добавить продукт в спиок или показать спиок? (ADD / SHOW)
ADD
--- Напишите название продукта
Хлеб
---Хлеб в списке


---Добавить продукт в спиок или показать спиок? (ADD / SHOW)
SHOW

---Список продуктов: Молоко, Хлеб

answer = input("Что делать?")
if answer == "ADD":
    print("rlkfrovor")
